function house(input) {

    let x = Number(input[0]);
    let y = Number(input[1]);
    let h = Number(input[2]);

    let greenPaint = 3.4;
    let redPaint = 4.3;

    let walls = ((Math.pow(x, 2) * 2) - (1.2 * 2) + ((x * y) * 2) - (Math.pow(1.5, 2) * 2)) / greenPaint
    let ceiling = (x * y * 2 + x * h) / redPaint

    
    console.log(walls.toFixed(2));
    console.log(ceiling.toFixed(2));

}
house(["10.25", "15.45", "8.88"])



/*Напишете програма, която да пресмята колко литра боя е нужна за боядисването на къщa. 
Като за стените се използва зелена боя, а за покрива – червена. Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2.
Стените имат следните размери:
•	Предната и задната стена са квадрати със страна „x“
o	на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
•	Страничните стени са правоъгълници със страни „x“ и „y“
o	и на двете странични стени има по един квадратен прозорец със страна 1.5м
Покривът има следните размери:
•	Два правоъгълника със страни „x“ и „y“
•	Два равностранни триъгълника със страна „x“ и височина „h“
Трябва да пресметнете площта на всички страни и площта на покрива, за да
намерите колко литра от всяка боя ще са нужни.
 
От конзолата се четат 3 реда:
1.	x – височината на къщата – реално число в интервала [2...100]
2.	y – дължината на страничната стена – реално число в интервала [2...100]
3.	h – височината на триъгълната стена на прокрива – реално число в интервала [2...100]


*/