//charCodeAt е метод на JavaScript, който се използва за намиране на числовия код (ASCII код) на символ в низ.
// Този метод приема индекс на символа в низа и връща числовата стойност, представляваща ASCII кода на този символ.

//Пример:

const text = "Hello";
const firstChar = text.charCodeAt(0);

console.log(firstChar); // Резултатът ще бъде 72, тъй като "H" има ASCII код 72.


//В горния пример, charCodeAt(0) се използва, за да се намери ASCII кода на първия символ в низа "Hello", който е "H". Резултатът е 72.
//Методът charCodeAt е полезен, когато искате да работите с числови стойности, представляващи символи във вашия код,
// например когато трябва да сравнявате символи или да ги обработвате по някакъв начин, използвайки техните ASCII кодове.

